Revit 2027 API
ViewSet.Insert Method
Insert the specified view into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	View item
)
Public Overridable Function Insert (
	item As View
) As Boolean
public:
virtual bool Insert(
	View^ item
)
abstract Insert :
        item : View -> bool
override Insert :
        item : View -> bool
Parameters
item View
The view to be inserted into the set.
Return Value
Boolean
Returns whether the view was inserted into the set.
See Also
Reference
ViewSet Class
Autodesk.Revit.DB Namespace